{
    "griggs": [
        "Oh, hello.",
        "I regret meeting you under such compromising circumstances.",
        "At least we both made it back unscathed.",
        "Incidentally, would you care to learn any sorceries?.",
        "You're clearly talented, and besides, I owe you.",
        "Of course, we will require some materials, but I am happy to teach you some elementary spells. Are you interested?.",
        "Terrific to see us both in one piece.",
        "And prey that you never go hollow.",
        "Well you certainly are keeping at it.",
        "Myself? I'm fine.",
        "It's not that I am concerned for Master Logan's welfare.",
        "Even in this treacherous land, Logan's skills are unmatched. He is a true hero.",
        "…No, the reason I seek Logan is…",
        "…Well, it's really my own conceit, now isn't it?"

    ],
    "bigHatLogan": [
        "Mm, you seem quite lucid! A rare thing in these times. I am Logan. I'm a bit cooped up, as you can see. I have a bright idea.",
        "Suppose you set me free. I'm old and empty-handed, but I could repay you with knowledge, and sorcery.",
        "This place is melting my mind. The inactivity is repressive",
        "Oh, heavens, thank you. I'm saved. And, I'd love to resume my travels, but I must log a few things first, and I owe you a favour. I will return to Firelink Shrine. Speak with me there, so that I may impart my sorcery.",
        "There you are. I was expecting you. As promised I will share my sorceries.",
        "Hello there. You really are very diligent. Oh, I understand. We are in the midst of a revolution!",
        "Oh hello there. Where have you been? Time is a resource. Let's delve in promptly.",
        "Come again. The knowledge here is limitless. I will absorb it, then share it with you.",
        "Come again, any time you please. For I too, learn, whilst teaching a student.",
        "Mm...mm...(Gibberish)",
        "Oh there you are, it has been a while. Or, were you just here? This fascinating place defeats my sense of time..."
    ],
    "crestfallenWarrior": [
        "Well, what do we have here? You must be a new arrival.",        
        "Let me guess. Fate of the Undead, right? Well, you're not the first.",        
        "But there's no salvation here. You'd have done better to rot in the Undead Asylum… But, too late now",        
        "Well, since you're here… Let me help you out.",        
        "One of the bells is up above in the Undead Church, but the lift is broken.",        
        "You'll have to climb the stairs up the ruins, and access the Undead Burg through the waterway.",        
        "Don't you ever repair your weapons?",        
        "Oh, have you seen that terribly morose lass? … The Fire Keeper",        
        "They probably cut her tongue out back in her village, so that she'd never say any god's name in vain.",        
        "Hah hah hah hah…",        
        "That is incredible, I must say… But now we have a new problem.",        
        "I don't really care; I'm simply crestfallen…"       
      
    ],
    "fireKeeper": [
        "… Th, thank you…",        
        "… I am Anastacia of Astora.",        
        "… Now I can continue my duty as a Keeper.",        
        "… But… I only hope that my impure tongue does not offend.",        
        "… Forgive me…",        
        "… I am impure, my tongue never intended for restoration.",        
        "… Please, if you have any heart…",        
        "… Leave me be…",        
        "… That you have agreed to link the Fire.",        
        "… I thank you, sincerely.",        
        "… Finally, the curse of the Undead will be lifted, and I can die human.",        
        "… I am powerless, but I will do all that I can.",        
        "… Please, save us all…",        
        "… Please…"        
    ],
    "lautrec": [
        "Ahh, hello there…",        
        "I am grateful to you for freeing me.",        
        "Keh heh heh heh…",        
        "Keh heh heh heh…",        
        "Now, who do you imagine will make the best use of it, hmm?",        
        "Hmm… Your humanity is really slipping.",        
        "By the lords… Your face…",        
        "Well, where have you been?",        
        "But there are methods. Most fools have more humanity than they know what to do with.",        
        "Now, who do you imagine will make the best use of it, hmm?",        
        "I have nothing to say. Be gone from my sight.",        
        "I have a rather, pressing matter to attend to up above.",        
        "Hm, you again? What is it?",        
        "Ah, you certainly are keeping busy.",        
        "That Keeper has served me well, but… enough with her…"        
    ],

    "laurentius": [
        "Well, I see you made it out!",        
        "Yeah, I made it out safely, too.",        
        "I have my Pyromancy of the Great Swamp, so I can usually manage, with a bit of care.",        
        "Oh, yeah, by the way, er, I can share my spell with you.",        
        "I think you have a knack for it. All you need are the materials.",        
        "… Ah, unless you find the magics unsavoury?.",        
        "Good bye then.",        
        "You've been a stranger these days.",        
        "As always, if you provide the materials, I can teach you pyromancy.",        
        "Pyromancy is the art of casting fire.",        
        "Hah hah hah hah.",        
        "You are an odd one.",        
        "That was rather abrupt.",        
        "He said that 'Pyromancy is the ultimate fantasy…'",        
        "The Witch of Izalith, one of the legendary Lords,is the godmother of pyromancy.So, the day I became Undead, I was ecstatic."        
    ]
}